soap-web-service/soap-client/soap-client-addressing/wsdls/addressing/CustomAddress.wsdl

<!--Published by JAX-WS RI (http://jax-ws.java.net). 
	RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e.-->
<!--Generated by JAX-WS RI (http://jax-ws.java.net). 
	RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e.-->
<definitions targetNamespace="http://address.service.soap.com/" name="CustomAddressService" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://address.service.soap.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsa="http://www.w3.org/2005/08/addressing">
   <wsp:Policy wsu:Id="AddressServicePortBinding_WSAM_Addressing_Policy">
      <wsam:Addressing wsp:Optional="true">
         <wsp:Policy/>
      </wsam:Addressing>
   </wsp:Policy>
   <types>
      <xsd:schema>
         <xsd:import namespace="http://www.w3.org/2005/08/addressing" schemaLocation="ws-addr.xsd"/>
      </xsd:schema>
      <xsd:schema>
         <xsd:import namespace="http://address.service.soap.com/" schemaLocation="CustomAddress.xsd"/>
      </xsd:schema>
   </types>
   <message name="findSubscriber">
      <part name="parameters" element="tns:findSubscriber"/>
   </message>
   <message name="findSubscriberResponse">
      <part name="parameters" element="tns:findSubscriberResponse"/>
   </message>
   <message name="AsyncRequestHeadInfo">
      <part name="messageId" element="wsa:MessageID"/>
      <part name="replyTo" element="wsa:ReplyTo"/>
      <part name="faultTo" element="wsa:FaultTo"/>
   </message>
   <portType name="AddressPortType">
      <operation name="findSubscriber">
         <input wsaw:Action="http://address.service.soap.com/AddressPortType/findSubscriberRequest" wsam:Action="http://address.service.soap.com/AddressPortType/findSubscriberRequest" message="tns:findSubscriber"></input>
         <output wsam:Action="http://address.service.soap.com/AddressPortType/findSubscriberResponse" message="tns:findSubscriberResponse"/>
      </operation>
   </portType>
   <binding name="AddressServicePortBinding" type="tns:AddressPortType">
      <wsaw:UsingAddressing/>
      <wsp:PolicyReference URI="#AddressServicePortBinding_WSAM_Addressing_Policy"/>
      <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
      <operation name="findSubscriber">
         <soap:operation soapAction=""/>
         <input>
            <soap:body use="literal"/>
            <soap:header message="tns:AsyncRequestHeadInfo" part="messageId" use="literal"/>
            <soap:header message="tns:AsyncRequestHeadInfo" part="replyTo" use="literal"/>
            <soap:header message="tns:AsyncRequestHeadInfo" part="faultTo" use="literal"/>
         </input>
         <output>
            <soap:body use="literal"/>
         </output>
      </operation>
   </binding>
   <service name="CustomAddressService">
      <port name="AddressServicePort" binding="tns:AddressServicePortBinding">
         <soap:address location="http://localhost:10001/SoapWS/CustomAddress"/>
      </port>
   </service>
</definitions>