soap-web-service/soap-publisher/SampleAddressingRequest.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:add="http://address.service.soap.com/"
	xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<soapenv:Header>
		<wsa:MessageID>M1</wsa:MessageID>
		<wsa:ReplyTo>
			<wsa:Address>http://172.18.208.1:9999/replyto</wsa:Address>
		</wsa:ReplyTo>
		<wsa:FaultTo>
			<wsa:Address>http://172.18.208.1:8889/faultto</wsa:Address>
		</wsa:FaultTo>
		<wsa:To>http://localhost:10001/SoapWS/CustomAddress1</wsa:To>
		<wsa:Action>http://address.service.soap.com/AddressPortType/findSubscriberRequest</wsa:Action>
	</soapenv:Header>
	<soapenv:Body>
		<add:findSubscriber>
			<subscriberNumber>919903123499</subscriberNumber>
		</add:findSubscriber>
	</soapenv:Body>
</soapenv:Envelope>
<S:Envelope
	xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header xmlns="http://www.w3.org/2005/08/addressing">
		<Action>http://address.service.soap.com/AddressPortType/findSubscriberResponse</Action>
		<MessageID>uuid:f3f04ea6-caa9-46b8-89b6-a0830a4f9dbe</MessageID>
		<RelatesTo>M1</RelatesTo>
		<To>http://172.18.208.1:9999/replyto</To>
	</S:Header>
	<S:Body xmlns:ns2="http://address.service.soap.com/">
		<ns2:findSubscriberResponse />
	</S:Body>
</S:Envelope>